reports/local_600tunn_10inst_1000batch_500user.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
           * thousand-vus: 500 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
thousand-vus   [   1% ] 500 VUs  0m00.9s/1m0s

running (0m01.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
thousand-vus   [   3% ] 500 VUs  0m01.9s/1m0s

running (0m02.9s), 500/500 VUs, 62 complete and 0 interrupted iterations
thousand-vus   [   5% ] 500 VUs  0m02.9s/1m0s

running (0m03.9s), 500/500 VUs, 249 complete and 0 interrupted iterations
thousand-vus   [   6% ] 500 VUs  0m03.9s/1m0s

running (0m04.9s), 500/500 VUs, 587 complete and 0 interrupted iterations
thousand-vus   [   8% ] 500 VUs  0m04.9s/1m0s

running (0m05.9s), 500/500 VUs, 967 complete and 0 interrupted iterations
thousand-vus   [  10% ] 500 VUs  0m05.9s/1m0s

running (0m06.9s), 500/500 VUs, 1236 complete and 0 interrupted iterations
thousand-vus   [  11% ] 500 VUs  0m06.9s/1m0s

running (0m07.9s), 500/500 VUs, 1448 complete and 0 interrupted iterations
thousand-vus   [  13% ] 500 VUs  0m07.9s/1m0s

running (0m08.9s), 500/500 VUs, 1730 complete and 0 interrupted iterations
thousand-vus   [  15% ] 500 VUs  0m08.9s/1m0s

running (0m09.9s), 500/500 VUs, 1902 complete and 0 interrupted iterations
thousand-vus   [  16% ] 500 VUs  0m09.9s/1m0s

running (0m10.9s), 500/500 VUs, 2094 complete and 0 interrupted iterations
thousand-vus   [  18% ] 500 VUs  0m10.9s/1m0s

running (0m11.9s), 500/500 VUs, 2304 complete and 0 interrupted iterations
thousand-vus   [  20% ] 500 VUs  0m11.9s/1m0s

running (0m12.9s), 500/500 VUs, 2502 complete and 0 interrupted iterations
thousand-vus   [  21% ] 500 VUs  0m12.9s/1m0s

running (0m13.9s), 500/500 VUs, 2657 complete and 0 interrupted iterations
thousand-vus   [  23% ] 500 VUs  0m13.9s/1m0s

running (0m14.9s), 500/500 VUs, 2848 complete and 0 interrupted iterations
thousand-vus   [  25% ] 500 VUs  0m14.9s/1m0s

running (0m15.9s), 500/500 VUs, 3031 complete and 0 interrupted iterations
thousand-vus   [  26% ] 500 VUs  0m15.9s/1m0s

running (0m16.9s), 500/500 VUs, 3190 complete and 0 interrupted iterations
thousand-vus   [  28% ] 500 VUs  0m16.9s/1m0s

running (0m17.9s), 500/500 VUs, 3345 complete and 0 interrupted iterations
thousand-vus   [  30% ] 500 VUs  0m17.9s/1m0s

running (0m18.9s), 500/500 VUs, 3546 complete and 0 interrupted iterations
thousand-vus   [  31% ] 500 VUs  0m18.9s/1m0s

running (0m19.9s), 500/500 VUs, 3743 complete and 0 interrupted iterations
thousand-vus   [  33% ] 500 VUs  0m19.9s/1m0s

running (0m20.9s), 500/500 VUs, 3921 complete and 0 interrupted iterations
thousand-vus   [  35% ] 500 VUs  0m20.9s/1m0s

running (0m21.9s), 500/500 VUs, 4148 complete and 0 interrupted iterations
thousand-vus   [  36% ] 500 VUs  0m21.9s/1m0s

running (0m22.9s), 500/500 VUs, 4316 complete and 0 interrupted iterations
thousand-vus   [  38% ] 500 VUs  0m22.9s/1m0s

running (0m23.9s), 500/500 VUs, 4504 complete and 0 interrupted iterations
thousand-vus   [  40% ] 500 VUs  0m23.9s/1m0s

running (0m24.9s), 500/500 VUs, 4656 complete and 0 interrupted iterations
thousand-vus   [  41% ] 500 VUs  0m24.9s/1m0s

running (0m25.9s), 500/500 VUs, 4847 complete and 0 interrupted iterations
thousand-vus   [  43% ] 500 VUs  0m25.9s/1m0s

running (0m26.9s), 500/500 VUs, 4993 complete and 0 interrupted iterations
thousand-vus   [  45% ] 500 VUs  0m26.9s/1m0s

running (0m27.9s), 500/500 VUs, 5171 complete and 0 interrupted iterations
thousand-vus   [  46% ] 500 VUs  0m27.9s/1m0s

running (0m28.9s), 500/500 VUs, 5389 complete and 0 interrupted iterations
thousand-vus   [  48% ] 500 VUs  0m28.9s/1m0s

running (0m29.9s), 500/500 VUs, 5588 complete and 0 interrupted iterations
thousand-vus   [  50% ] 500 VUs  0m29.9s/1m0s

running (0m30.9s), 500/500 VUs, 5798 complete and 0 interrupted iterations
thousand-vus   [  51% ] 500 VUs  0m30.9s/1m0s

running (0m31.9s), 500/500 VUs, 6009 complete and 0 interrupted iterations
thousand-vus   [  53% ] 500 VUs  0m31.9s/1m0s

running (0m32.9s), 500/500 VUs, 6202 complete and 0 interrupted iterations
thousand-vus   [  55% ] 500 VUs  0m32.9s/1m0s

running (0m33.9s), 500/500 VUs, 6392 complete and 0 interrupted iterations
thousand-vus   [  56% ] 500 VUs  0m33.9s/1m0s

running (0m34.9s), 500/500 VUs, 6608 complete and 0 interrupted iterations
thousand-vus   [  58% ] 500 VUs  0m34.9s/1m0s

running (0m35.9s), 500/500 VUs, 6826 complete and 0 interrupted iterations
thousand-vus   [  60% ] 500 VUs  0m35.9s/1m0s

running (0m36.9s), 500/500 VUs, 7008 complete and 0 interrupted iterations
thousand-vus   [  61% ] 500 VUs  0m36.9s/1m0s

running (0m37.9s), 500/500 VUs, 7220 complete and 0 interrupted iterations
thousand-vus   [  63% ] 500 VUs  0m37.9s/1m0s

running (0m38.9s), 500/500 VUs, 7409 complete and 0 interrupted iterations
thousand-vus   [  65% ] 500 VUs  0m38.9s/1m0s

running (0m39.9s), 500/500 VUs, 7535 complete and 0 interrupted iterations
thousand-vus   [  66% ] 500 VUs  0m39.9s/1m0s

running (0m40.9s), 500/500 VUs, 7728 complete and 0 interrupted iterations
thousand-vus   [  68% ] 500 VUs  0m40.9s/1m0s

running (0m41.9s), 500/500 VUs, 7880 complete and 0 interrupted iterations
thousand-vus   [  70% ] 500 VUs  0m41.9s/1m0s

running (0m42.9s), 500/500 VUs, 8089 complete and 0 interrupted iterations
thousand-vus   [  71% ] 500 VUs  0m42.9s/1m0s

running (0m43.9s), 500/500 VUs, 8271 complete and 0 interrupted iterations
thousand-vus   [  73% ] 500 VUs  0m43.9s/1m0s

running (0m44.9s), 500/500 VUs, 8473 complete and 0 interrupted iterations
thousand-vus   [  75% ] 500 VUs  0m44.9s/1m0s

running (0m45.9s), 500/500 VUs, 8697 complete and 0 interrupted iterations
thousand-vus   [  76% ] 500 VUs  0m45.9s/1m0s

running (0m46.9s), 500/500 VUs, 8888 complete and 0 interrupted iterations
thousand-vus   [  78% ] 500 VUs  0m46.9s/1m0s

running (0m47.9s), 500/500 VUs, 9078 complete and 0 interrupted iterations
thousand-vus   [  80% ] 500 VUs  0m47.9s/1m0s

running (0m48.9s), 500/500 VUs, 9311 complete and 0 interrupted iterations
thousand-vus   [  81% ] 500 VUs  0m48.9s/1m0s

running (0m49.9s), 500/500 VUs, 9493 complete and 0 interrupted iterations
thousand-vus   [  83% ] 500 VUs  0m49.9s/1m0s

running (0m50.9s), 500/500 VUs, 9698 complete and 0 interrupted iterations
thousand-vus   [  85% ] 500 VUs  0m50.9s/1m0s

running (0m51.9s), 500/500 VUs, 9918 complete and 0 interrupted iterations
thousand-vus   [  86% ] 500 VUs  0m51.9s/1m0s

running (0m52.9s), 500/500 VUs, 10105 complete and 0 interrupted iterations
thousand-vus   [  88% ] 500 VUs  0m52.9s/1m0s

running (0m53.9s), 500/500 VUs, 10267 complete and 0 interrupted iterations
thousand-vus   [  90% ] 500 VUs  0m53.9s/1m0s

running (0m54.9s), 500/500 VUs, 10424 complete and 0 interrupted iterations
thousand-vus   [  91% ] 500 VUs  0m54.9s/1m0s

running (0m55.9s), 500/500 VUs, 10655 complete and 0 interrupted iterations
thousand-vus   [  93% ] 500 VUs  0m55.9s/1m0s

running (0m56.9s), 500/500 VUs, 10867 complete and 0 interrupted iterations
thousand-vus   [  95% ] 500 VUs  0m56.9s/1m0s

running (0m57.9s), 500/500 VUs, 11131 complete and 0 interrupted iterations
thousand-vus   [  96% ] 500 VUs  0m57.9s/1m0s

running (0m58.9s), 500/500 VUs, 11399 complete and 0 interrupted iterations
thousand-vus   [  98% ] 500 VUs  0m58.9s/1m0s

running (0m59.9s), 500/500 VUs, 11636 complete and 0 interrupted iterations
thousand-vus   [ 100% ] 500 VUs  0m59.9s/1m0s

running (1m00.9s), 250/500 VUs, 11899 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m01.9s), 123/500 VUs, 12026 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m02.9s), 106/500 VUs, 12043 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m03.9s), 091/500 VUs, 12058 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m04.9s), 082/500 VUs, 12067 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m05.9s), 069/500 VUs, 12080 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m06.9s), 064/500 VUs, 12085 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m07.9s), 047/500 VUs, 12102 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m08.9s), 033/500 VUs, 12116 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m09.9s), 027/500 VUs, 12122 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m10.9s), 008/500 VUs, 12141 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m11.9s), 002/500 VUs, 12147 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m12.9s), 002/500 VUs, 12147 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m13.9s), 002/500 VUs, 12147 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m14.9s), 001/500 VUs, 12148 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m15.9s), 001/500 VUs, 12148 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m16.9s), 001/500 VUs, 12148 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m17.9s), 001/500 VUs, 12148 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m18.9s), 001/500 VUs, 12148 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m19.7s), 000/500 VUs, 12149 complete and 0 interrupted iterations
thousand-vus ✓ [ 100% ] 500 VUs  1m0s

     ✗ status is 200
      ↳  56% — ✓ 6916 / ✗ 5233

     checks.........................: 56.92% ✓ 6916       ✗ 5233 
     data_received..................: 51 MB  643 kB/s
     data_sent......................: 6.5 MB 81 kB/s
     http_req_blocked...............: avg=265.86ms min=0s       med=251.53ms max=10.28s   p(90)=464.97ms p(95)=571.72ms
     http_req_connecting............: avg=107.28ms min=0s       med=119.82ms max=1.17s    p(90)=194.67ms p(95)=246.47ms
     http_req_duration..............: avg=1.15s    min=0s       med=248.46ms max=53.09s   p(90)=2.28s    p(95)=10.13s  
       { expected_response:true }...: avg=615.58ms min=236.17ms med=262.53ms max=43.41s   p(90)=982.35ms p(95)=2.29s   
     http_req_failed................: 43.07% ✓ 5233       ✗ 6916 
     http_req_receiving.............: avg=242.92µs min=0s       med=46.64µs  max=124.22ms p(90)=189.32µs p(95)=788.3µs 
     http_req_sending...............: avg=166.29µs min=0s       med=114.06µs max=17.96ms  p(90)=292µs    p(95)=372.19µs
     http_req_tls_handshaking.......: avg=126.38ms min=0s       med=128.7ms  max=1.66s    p(90)=240.28ms p(95)=276.11ms
     http_req_waiting...............: avg=1.15s    min=0s       med=248.12ms max=53.09s   p(90)=2.28s    p(95)=10.13s  
     http_reqs......................: 12149  152.468019/s
     iteration_duration.............: avg=2.55s    min=1s       med=1.51s    max=54.42s   p(90)=4.86s    p(95)=11.47s  
     iterations.....................: 12149  152.468019/s
     vus............................: 1      min=1        max=500
     vus_max........................: 500    min=500      max=500